[
  {
    "id": "mri",
    "type": "MRI",
    "name": "Magnetic Resonance Imaging",
    "description": "A non-invasive imaging technique that uses powerful magnets and radio waves to create detailed images of organs and tissues within the body.",
    "body_parts": ["Brain", "Spine", "Knee", "Shoulder", "Hip", "Abdomen", "Pelvis", "Chest"],
    "preparation": "Remove all metal objects. Inform your technologist about any medical implants. You may be asked to avoid eating or drinking for a few hours before certain scans.",
    "duration": "30-60 minutes",
    "is_contrast_available": true
  },
  {
    "id": "ct",
    "type": "CT",
    "name": "Computed Tomography Scan",
    "description": "A computerized X-ray imaging procedure that creates detailed cross-sectional images of the body, including bones, blood vessels and soft tissues.",
    "body_parts": ["Brain", "Chest", "Abdomen", "Pelvis", "Spine", "Sinuses"],
    "preparation": "You may be asked to avoid eating or drinking for a few hours before the scan. Wear comfortable, loose-fitting clothing without metal fasteners.",
    "duration": "15-30 minutes",
    "is_contrast_available": true
  },
  {
    "id": "xray",
    "type": "X-Ray",
    "name": "X-Ray Imaging",
    "description": "A quick, painless test that produces images of the structures inside your body, particularly your bones.",
    "body_parts": ["Chest", "Spine", "Extremities", "Abdomen", "Skull", "Sinuses", "Dental"],
    "preparation": "No special preparation is needed. You may be asked to remove jewelry, eyeglasses, or metal objects from the area being examined.",
    "duration": "5-15 minutes",
    "is_contrast_available": false
  },
  {
    "id": "ultrasound",
    "type": "Ultrasound",
    "name": "Diagnostic Ultrasound",
    "description": "A safe and painless procedure that uses sound waves to produce images of the inside of the body.",
    "body_parts": ["Abdomen", "Pelvis", "Breast", "Thyroid", "Scrotum", "Blood vessels", "Soft tissues"],
    "preparation": "Preparation varies depending on the area being examined. You may be asked to fast for several hours or drink water to fill your bladder.",
    "duration": "15-45 minutes",
    "is_contrast_available": false
  },
  {
    "id": "mammography",
    "type": "Mammogram",
    "name": "Digital Mammography",
    "description": "A specialized X-ray imaging used to create detailed images of the breast, primarily used for breast cancer screening and diagnosis.",
    "body_parts": ["Breast"],
    "preparation": "Do not use deodorant, perfume, powders, or ointments on your breasts on the day of the exam. Describe any breast symptoms to the technologist.",
    "duration": "20-30 minutes",
    "is_contrast_available": false
  },
  {
    "id": "pet-ct",
    "type": "PET/CT",
    "name": "Positron Emission Tomography/Computed Tomography",
    "description": "A nuclear medicine technique that combines PET and CT to provide detailed information about both the structure and function of cells and tissues in the body.",
    "body_parts": ["Whole body", "Brain", "Heart"],
    "preparation": "Fast for 4-6 hours before the exam. Avoid strenuous exercise for 24 hours prior. Your doctor may provide specific instructions based on your condition.",
    "duration": "90-120 minutes",
    "is_contrast_available": true
  },
  {
    "id": "bone-density",
    "type": "Bone Density",
    "name": "Bone Density Scan (DEXA)",
    "description": "A special type of X-ray that measures bone mineral density to assess the strength of your bones, commonly used to diagnose osteoporosis.",
    "body_parts": ["Spine", "Hip", "Forearm"],
    "preparation": "Avoid calcium supplements for 24 hours before the exam. Wear loose, comfortable clothing without metal fasteners.",
    "duration": "10-20 minutes",
    "is_contrast_available": false
  },
  {
    "id": "fluoroscopy",
    "type": "Fluoroscopy",
    "name": "Fluoroscopy Procedure",
    "description": "A type of medical imaging that shows a continuous X-ray image on a monitor, like an X-ray movie, used to observe the movement of a body part or the path of contrast agent through the body.",
    "body_parts": ["Digestive tract", "Joints", "Spine", "Urinary tract"],
    "preparation": "Preparation varies depending on the specific procedure. You may need to fast or take a laxative beforehand for some procedures.",
    "duration": "15-45 minutes",
    "is_contrast_available": true
  },
  {
    "id": "nuclear-medicine",
    "type": "Nuclear Medicine",
    "name": "Nuclear Medicine Scan",
    "description": "Procedures that use small amounts of radioactive materials (radiotracers) to diagnose and determine the severity of various diseases, including many types of cancers, heart disease, and certain other abnormalities.",
    "body_parts": ["Thyroid", "Bones", "Heart", "Kidneys", "Liver", "Lungs"],
    "preparation": "Preparation varies by exam. Your doctor will provide specific instructions. You may need to stop taking certain medications temporarily.",
    "duration": "30-120 minutes",
    "is_contrast_available": true
  },
  {
    "id": "mra",
    "type": "MRA",
    "name": "Magnetic Resonance Angiography",
    "description": "A type of MRI scan that specifically examines blood vessels, used to evaluate blood flow and detect abnormalities like aneurysms or blockages.",
    "body_parts": ["Brain", "Neck", "Chest", "Abdomen", "Extremities"],
    "preparation": "Remove all metal objects. Inform your technologist about any medical implants. You may need to avoid eating or drinking for several hours before the scan.",
    "duration": "30-60 minutes",
    "is_contrast_available": true
  },
  {
    "id": "cta",
    "type": "CTA",
    "name": "Computed Tomography Angiography",
    "description": "A CT scan technique focused on blood vessels, used to examine the arteries and veins throughout the body, including those in the brain, neck, heart, chest, abdomen, and legs.",
    "body_parts": ["Brain", "Neck", "Heart", "Chest", "Abdomen", "Legs"],
    "preparation": "You may be asked to fast for 4-6 hours before the exam. Wear comfortable clothing without metal fasteners. Inform your doctor about any allergies to contrast material.",
    "duration": "15-30 minutes",
    "is_contrast_available": true
  },
  {
    "id": "cardiac-mri",
    "type": "Cardiac MRI",
    "name": "Cardiac Magnetic Resonance Imaging",
    "description": "A specialized MRI scan that evaluates the structure and function of the heart in great detail, including the heart muscle, valves, and blood vessels.",
    "body_parts": ["Heart"],
    "preparation": "Remove all metal objects. Inform your technologist about any medical implants. You may need to avoid eating or drinking for several hours before the scan.",
    "duration": "45-90 minutes",
    "is_contrast_available": true
  }
]